### Data Wrangling:

In [2]:
import pandas as pd
import numpy as np

In [143]:
#importing Metro_Zhvi_AllHomes file 
Metro_Zhvi_AllHomes = pd.read_csv('Metro_Zhvi_AllHomes.csv')

In [144]:
#Dropping unwanted columns from Obama dataframe
Metro_Zhvi_AllHomes.drop(['SizeRank' , 'RegionID'],axis=1,inplace=True)

### Data Wrangling for Affordability chart:

In [108]:
#calculated annual expenses from MIT data http://livingwage.mit.edu/counties/48015
Annual_Expenses_for_one_adult_NY = 3464 +0 + 2392 + 13597 + 3568 + 2355  
Annual_Expenses_for_one_adult_NY

25376

In [109]:
#calculated annual expenses from MIT data http://livingwage.mit.edu/counties/48015
Annual_Expenses_for_one_adult_SFO = 3560 + 0 + 1998 + 16717 + 3768 + 2799 
Annual_Expenses_for_one_adult_SFO

28842

In [110]:
#calculated annual expenses from MIT data http://livingwage.mit.edu/counties/48015
Annual_Expenses_for_one_adult_Austin = 2983 + 0 + 2158 + 7068 + 4401 + 2458 
Annual_Expenses_for_one_adult_Austin

19068

In [124]:
#importing Austin Salaries
Austin_salaries = pd.read_excel("Austin_Salaries.xlsx")

In [125]:
#importing SFO Salaries
SFO_Salaries = pd.read_excel("SFO_Salaries.xlsx")

In [126]:
##importing New York Salaries
Salary_NewYork = pd.read_excel("Salary_NewYork.xlsx")

In [130]:
#Adding a column CITY
Austin_salaries['City']= 'Austin'

In [131]:
#Adding a column CITY
SFO_Salaries['City'] = 'San Francisco'

In [132]:
#Adding a column CITY
Salary_NewYork['City'] = 'New York'

In [120]:
#appending all three files with occuapational aread along with salary data
salary_by_cities = Salary_NewYork.append([SFO_Salaries, Austin_salaries])

In [137]:
#covering dataframe salary_by_cities to a csv file
salary_by_cities.to_csv('salary_by_cities.csv')

In [146]:
#merging three city files
salaries_combined = pd.merge(pd.merge(Austin_salaries,SFO_Salaries,on='Occupational Area'),Salary_NewYork,on='Occupational Area')

In [21]:
salaries_combined['Salary_to_expense_Ratio_Austin'] = salaries_combined.Typical_Annual_Salary_Austin/Annual_Expenses_for_one_adult_Austin

In [22]:
salaries_combined['Salary_to_expense_Ratio_SFO'] = salaries_combined.Typical_Annual_Salary_SFO/Annual_Expenses_for_one_adult_SFO

In [23]:
salaries_combined['Salary_to_expense_Ratio_NY'] = salaries_combined.Typical_Annual_Salary_NY/Annual_Expenses_for_one_adult_NY

In [88]:
#coverting dataframe into csv file
salaries_combined.to_csv('salaries_combined.csv')

In [27]:
#taking this value from trendline graph calculations
Per_Sqft_All_Homes_NY = 248.7

In [28]:
#taking this value from trendline graph calculations
Per_Sqft_All_Homes_SFO = 552.3

In [29]:
#taking this value from trendline graph calculations
Per_Sqft_All_Homes_Austin = 145.1

In [30]:
#creating calculated field for Salary_per_sqft_NY 
salaries_combined['Salary_per_sqft_NY'] = salaries_combined.Typical_Annual_Salary_NY / Per_Sqft_All_Homes_NY

In [31]:
#creating calculated field for Salary_per_sqft_SFO 
salaries_combined['Salary_per_sqft_SFO'] = salaries_combined.Typical_Annual_Salary_SFO / Per_Sqft_All_Homes_SFO

In [32]:
#creating calculated field for Salary_per_sqft_Austin 
salaries_combined['Salary_per_sqft_Austin'] = salaries_combined.Typical_Annual_Salary_Austin / Per_Sqft_All_Homes_Austin

In [66]:
#coverting dataframe into csv file
salaries_combined.to_csv('salaries_combined1.csv')

In [33]:
#checking columns
salaries_combined.columns

Index([u'Occupational_Area', u'Typical_Annual_Salary_Austin',
       u'Typical_Annual_Salary_SFO', u'Typical_Annual_Salary_NY',
       u'Salary_to_expense_Ratio_Austin', u'Salary_to_expense_Ratio_SFO',
       u'Salary_to_expense_Ratio_NY', u'Salary_per_sqft_NY',
       u'Salary_per_sqft_SFO', u'Salary_per_sqft_Austin'],
      dtype='object')

In [148]:
#taking growth rate from http://www.careerglider.com/blog/austin-vs-sf-austin-better-spot-career/
Growth_Rate_Austin = 0.186

In [149]:
#taking growth rate from http://www.careerglider.com/blog/austin-vs-sf-austin-better-spot-career/
Growth_Rate_SFO = 0.338

In [150]:
#taking growth rate from http://www.careerglider.com/blog/austin-vs-sf-austin-better-spot-career/
Growth_Rate_NY = 0.228

In [151]:
salaries_combined['Salary_job_growth_per_expense_Austin'] = salaries_combined.Salary_to_expense_Ratio_Austin / Growth_Rate_Austin

In [153]:
salaries_combined['Salary_job_growth_per_expense_SFO'] = salaries_combined.Salary_to_expense_Ratio_SFO / Growth_Rate_SFO

In [152]:
salaries_combined['Salary_job_growth_per_expense_NY'] = salaries_combined.Salary_to_expense_Ratio_SFO / Growth_Rate_NY

In [154]:
#coverting dataframe into csv file
salaries_combined.to_csv('salaries_combined2.csv')

In [39]:
salaries_combined2 = salaries_combined.copy()

In [42]:
#Tried to normalize data for improving final version (unsuccessful attempt in the given time)
salaries_combined2['Salary_Austin_normal'] = salaries_combined2.Typical_Annual_Salary_Austin /salaries_combined2.Typical_Annual_Salary_Austin

In [43]:
#Tried to normalize data for improving final version (unsuccessful attempt in the given time)
salaries_combined2['Salary_SFO_normal'] = salaries_combined2.Typical_Annual_Salary_SFO /salaries_combined2.Typical_Annual_Salary_Austin

In [44]:
#Tried to normalize data for improving final version (unsuccessful attempt in the given time)
salaries_combined2['Salary_NY_normal'] = salaries_combined2.Typical_Annual_Salary_NY /salaries_combined2.Typical_Annual_Salary_Austin

In [155]:
#coverting dataframe into csv file
salaries_combined2.to_csv('salaries_combined2.csv')

### Data Wrangling for Home Price to Rent Ratio:

In [51]:
#importing Metro_Price_To_Rent_2017 to dataframe
Metro_Price_To_Rent_2017 = pd.read_csv('Metro_Price_To_Rent_2017.csv')

In [52]:
Metro_Price_To_Rent_2017['2017_Average'] = Metro_Price_To_Rent_2017.mean(axis=1)

In [54]:
national_average = Metro_Price_To_Rent_2017['2017_Average'].mean()
national_average

10.680598849384827

In [55]:
Metro_Price_To_Rent_2017.head()

,RegionName,2017-01,2017-02,2017-03,2017-04,2017-05,2017-06,2017-07,2017-08,2017-09,2017-10,2017_Average
0,United States,11.41,11.44,11.46,11.43,11.42,11.40,11.37,11.40,11.43,11.51,11.427
1,"New York, NY",13.23,13.29,13.38,13.40,13.47,13.44,13.42,13.40,13.42,13.39,13.384
2,"Los Angeles-Long Beach-Anaheim, CA",18.20,18.20,18.21,18.20,18.23,18.24,18.20,18.23,18.30,18.31,18.232
3,"Chicago, IL",10.41,10.45,10.45,10.39,10.37,10.36,10.35,10.36,10.39,10.39,10.392
4,"Dallas-Fort Worth, TX",10.62,10.69,10.77,10.84,10.90,10.95,10.97,10.99,11.03,11.09,10.885

In [56]:
Metro_Price_To_Rent_2017 = Metro_Price_To_Rent_2017.loc[Metro_Price_To_Rent_2017['RegionName'].isin(['New York, NY', 'San Francisco, CA', 'Austin, TX'])]

In [57]:
Metro_Price_To_Rent_2017

,RegionName,2017-01,2017-02,2017-03,2017-04,2017-05,2017-06,2017-07,2017-08,2017-09,2017-10,2017_Average
1,"New York, NY",13.23,13.29,13.38,13.40,13.47,13.44,13.42,13.40,13.42,13.39,13.384
11,"San Francisco, CA",20.45,20.67,20.76,20.76,20.86,20.84,20.77,20.74,20.70,20.80,20.735
31,"Austin, TX",12.67,12.70,12.83,12.94,12.92,12.91,12.91,12.96,13.04,13.38,12.926

In [58]:
Metro_Price_To_Rent_2017 = Metro_Price_To_Rent_2017[['RegionName', '2017_Average']]

In [65]:
Metro_Price_To_Rent_2017

           RegionName  2017_Average  National_avg_normal
1        New York, NY        13.384             2.703401
11  San Francisco, CA        20.735            10.054401
31         Austin, TX        12.926             2.245401

In [64]:
Metro_Price_To_Rent_2017['National_avg_normal'] =  Metro_Price_To_Rent_2017['2017_Average'] - national_average

/anaconda/lib/python2.7/site-packages/ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  """Entry point for launching an IPython kernel.

In [69]:
Metro_Price_To_Rent_2017.to_csv('Metro_Price_To_Rent_2017_normal.csv')